package PC_prac;

public class SessionCookie {

	
//	Connectionless Protocol
//	웹 서비스는 HTTP 프로토콜을 기반으로 하는데,
//	HTTP 프로토콜은 클라이언트와 서버의 관계를 
//	유지 하지 않는 특징이 있다.
//	한번 요청할 때 마다 한번 응답을 해주고 연결을 해제
//
//	서버의 부하를 줄일 수 있는 장점은 있으나
//	클라이언트 요청시마다 서버와 매번 새로운 연결이 생성되기 때문에
//	일반적인 로그인 상태유지, 장바구니 등의 기능을 구현하기 어렵다.
//
//	이러한 불편함을 해결하기 위해서 
//	세션과 쿠키를 이용한다.
//	세션과 쿠키는 클라이언트와 서버의 연결 상태를 유지해주는 방법으로
//	세션은 서버에서 연결 정보를 관리하는 반면,
//	쿠키는 클라이언트에서 연결정보를 관리하는데 차이가 있다.
	
//	getId() 세션 ID를 반환다.
//	setAttribute() 세션 객체에 속성을 저장한다.
//	getAttribute() 세션 객체에 저장된 속성을 반환한다.
//	removeAttribute() 세션 객체에 저장된 속성을 제거한다.
//	setMaxInactiveInte
//	rval()
//	세션 객체의 유지시간을 설정한다.
//	getMaxInactiveInte
//	rval()
//	세션 객체의 유지시간을 반환한다.
//	invalidate() 세션 객체의 모든 정보를 삭제한다

}
